app/views/users/show.html.erb

SELECT  1 AS one FROM `chores` WHERE `chores`.`user_id` = 1 LIMIT 1
---
  <!-- <div class="col-md-4">
    <% if @user.chores.any? %>