app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @chores = @user.chores.paginate(page: params[:page], per_page: 5)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT COUNT(*) FROM `chores` WHERE `chores`.`user_id` = 1

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('holly.jo.robertson22', 'holly.jo.robertson22@gmail.com', '$2a$12$ivyGTDHWXjWf.gZfT/tGl.AzCEwJrJtVLQWc59wSyjDQWM9fFhE8G', '2020-03-29 15:42:21', '2020-03-29 15:42:21')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `email` = 'ryandurham2@gmail.com', `password_digest` = '$2a$12$js9PtdIpYrBz2wfZ3FrAk.Vy0Anbeo.iWCjPtxxdToLnsVRjfpGEC', `updated_at` = '2020-04-05 17:58:34' WHERE `users`.`id` = 18

  def destroy
    set_user
    @destroyeduser = @user.name
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 1